@echo off
@chcp 866

echo Прошиваем мастера
echo ===========================
echo = Стираем все КЕМ
echo ===========================
st-link_cli -ME
echo ===========================
echo = Прошиваем саму прошивку
echo ===========================
st-link_cli -P lightControl_slave.hex 0x08000000 -V "after_programming"
echo ===========================
echo = Ставим защиту на чтение флэш
echo ===========================


echo ===========================
echo = Прошивка закончена
echo ===========================

echo ===========================
echo = Сброс
echo ===========================
st-link_cli -Rst